import { CscenterNoticeProps, CscenterFaqProps } from "@/types/cscenterDataType"

export const cscenternoticeData: CscenterNoticeProps[] = [
        {
            id: 1,
            url: '/cscenter/notice/id=1',
            title: "[이마트24] 8월 쿠폰 미적용점",
            date: "2021-07-31",
        },
        {
            id: 2,
            url: '/cscenter/notice/id=2',
            title: "[공지] 시스템 업그레이드 작업 공지(08/03)" ,
            date: "2023-07-26",
        },
        {
            id: 3,
            url: '/cscenter/notice/id=3',
            title: "[공지] 법인회원 포인트 적립 서비스 종료 안내" ,
            date: "2023-07-15",
        },
        {
            id: 4,
            url: '/cscenter/notice/id=4',
            title: "[이마트24] 7월 쿠폰 미적용점",
            date: "2021-06-29",
        },
        {
            id: 5,
            url: '/cscenter/notice/id=5',
            title: "[공지] CJ ONE 포인트 제휴 종료 안내",
            date: "2023-06-22",
        },
        {
            id: 6,
            url: '/cscenter/notice/id=6',
            title: "[공지] 시스템 업그레이드 작업 공지(05/25)" ,
            date: "2023-05-11",
        },
        {
            id: 7,
            url: '/cscenter/notice/id=7',
            title: "[공지] 개인정보처리방침 개정안내(5/8)",
            date: "2023-05-01",
        },
        {
            id: 8,
            url: '/cscenter/notice/id=8',
            title: "[이마트24] 8월 쿠폰 미적용점",
            date: "2021-07-31",
        },
        {
            id: 9,
            url: '/cscenter/notice/id=9',
            title: "[공지] 시스템 업그레이드 작업 공지(08/03)" ,
            date: "2023-07-26",
        },
        {
            id: 10,
            url: '/cscenter/notice/id=10',
            title: "[공지] 법인회원 포인트 적립 서비스 종료 안내" ,
            date: "2023-07-15",
        },
        {
            id: 11,
            url: '/cscenter/notice/id=11',
            title: "[이마트24] 7월 쿠폰 미적용점",
            date: "2021-06-29",
        },
        {
            id: 12,
            url: '/cscenter/notice/id=12',
            title: "[공지] CJ ONE 포인트 제휴 종료 안내",
            date: "2023-06-22",
        },
        {
            id: 13,
            url: '/cscenter/notice/id=13',
            title: "[공지] 시스템 업그레이드 작업 공지(05/25)" ,
            date: "2023-05-11",
        },
        {
            id: 14,
            url: '/cscenter/notice/id=14',
            title: "[공지] 개인정보처리방침 개정안내(5/8)",
            date: "2023-05-01",
        },
]

export const cscenterfaqData: CscenterFaqProps[] = [
    {
        id: 1,
        q_type1: "[회원]",
        q_type2: "[비밀번호]",
        q_txt: "신세계포인트 앱의 비밀번호가 기억나지 않아요.",
        a_txt: "•로그인 하단에 비밀번호 찾기에서 비밀번호 재설정이 가능합니다.",
    },
    {
        id: 2,
        q_type1: "[회원]",
        q_type2: "[정보수정]",
        q_txt: "개명을 하였습니다. 이름을 변경하려면 어떻게 해야 하죠?",
        a_txt: "•본인인증서비스와 통신사 등을 통해 개명된 이름으로 변경하신 후 신세계포인트 앱을 통해 본인인증을 하면, 개명된 이름으로 자동 변경됩니다.",
    },
    {
        id: 3,
        q_type1: "[회원]",
        q_type2: "[회원가입/탈퇴]",
        q_txt: "신세계포인트 회원가입은 어떻게 하나요?",
        a_txt: "• 신세계포인트 앱을 통해 본인인증 후 동의 절차를 거쳐 회원가입이 가능합니다.",
    },
    {
        id: 4,
        q_type1: "[이벤트/쿠폰]",
        q_type2: "[쿠폰]",
        q_txt: "쿠폰 확인은 어떻게 하나요?",
        a_txt: "• 쿠폰(메인화면 좌측 화살표 확인)으로 가시면 쿠폰 리스트 확인 가능하며, 개별 쿠폰에서 '다운로드'까지 하셔야 사용 가능합니다. 또한 다운 받은 쿠폰은 마이 혜택>마이 쿠폰함 에서 확인 가능합니다.",
    },
    {
        id: 5,
        q_type1: "[이벤트/쿠폰]",
        q_type2: "[이벤트]",
        q_txt: " 이벤트 결과 확인은 어디서 할 수 있나요? ",
        a_txt: "• 이벤트 결과 확인은 이벤트>당첨 확인에서 확인 가능합니다."
    },
    {
        id: 6,
        q_type1: "[회원]",
        q_type2: "[비밀번호]",
        q_txt: "신세계포인트 앱의 비밀번호가 기억나지 않아요.",
        a_txt: "•로그인 하단에 비밀번호 찾기에서 비밀번호 재설정이 가능합니다.",
    },
    {
        id: 7,
        q_type1: "[회원]",
        q_type2: "[정보수정]",
        q_txt: "개명을 하였습니다. 이름을 변경하려면 어떻게 해야 하죠?",
        a_txt: "•본인인증서비스와 통신사 등을 통해 개명된 이름으로 변경하신 후 신세계포인트 앱을 통해 본인인증을 하면, 개명된 이름으로 자동 변경됩니다.",
    },
    {
        id: 8,
        q_type1: "[회원]",
        q_type2: "[회원가입/탈퇴]",
        q_txt: "신세계포인트 회원가입은 어떻게 하나요?",
        a_txt: "• 신세계포인트 앱을 통해 본인인증 후 동의 절차를 거쳐 회원가입이 가능합니다.",
    },
    {
        id: 9,
        q_type1: "[이벤트/쿠폰]",
        q_type2: "[쿠폰]",
        q_txt: "쿠폰 확인은 어떻게 하나요?",
        a_txt: "• 쿠폰(메인화면 좌측 화살표 확인)으로 가시면 쿠폰 리스트 확인 가능하며, 개별 쿠폰에서 '다운로드'까지 하셔야 사용 가능합니다. 또한 다운 받은 쿠폰은 마이 혜택>마이 쿠폰함 에서 확인 가능합니다.",
    },
    {
        id: 10,
        q_type1: "[이벤트/쿠폰]",
        q_type2: "[이벤트]",
        q_txt: " 이벤트 결과 확인은 어디서 할 수 있나요? ",
        a_txt: "• 이벤트 결과 확인은 이벤트>당첨 확인에서 확인 가능합니다."
    },
    {
        id: 11,
        q_type1: "[회원]",
        q_type2: "[비밀번호]",
        q_txt: "신세계포인트 앱의 비밀번호가 기억나지 않아요.",
        a_txt: "•로그인 하단에 비밀번호 찾기에서 비밀번호 재설정이 가능합니다.",
    },
    {
        id: 12,
        q_type1: "[회원]",
        q_type2: "[정보수정]",
        q_txt: "개명을 하였습니다. 이름을 변경하려면 어떻게 해야 하죠?",
        a_txt: "•본인인증서비스와 통신사 등을 통해 개명된 이름으로 변경하신 후 신세계포인트 앱을 통해 본인인증을 하면, 개명된 이름으로 자동 변경됩니다.",
    },
    {
        id: 13,
        q_type1: "[회원]",
        q_type2: "[회원가입/탈퇴]",
        q_txt: "신세계포인트 회원가입은 어떻게 하나요?",
        a_txt: "• 신세계포인트 앱을 통해 본인인증 후 동의 절차를 거쳐 회원가입이 가능합니다.",
    },
    {
        id: 14,
        q_type1: "[이벤트/쿠폰]",
        q_type2: "[쿠폰]",
        q_txt: "쿠폰 확인은 어떻게 하나요?",
        a_txt: "• 쿠폰(메인화면 좌측 화살표 확인)으로 가시면 쿠폰 리스트 확인 가능하며, 개별 쿠폰에서 '다운로드'까지 하셔야 사용 가능합니다. 또한 다운 받은 쿠폰은 마이 혜택>마이 쿠폰함 에서 확인 가능합니다.",
    },
    {
        id: 15,
        q_type1: "[이벤트/쿠폰]",
        q_type2: "[이벤트]",
        q_txt: " 이벤트 결과 확인은 어디서 할 수 있나요? ",
        a_txt: "• 이벤트 결과 확인은 이벤트>당첨 확인에서 확인 가능합니다."
    },
]
