import { FindIdNotice } from "@/types/noticeDataType";

export const findNotice: FindIdNotice[]= [
    {
        id: 1,
        content: '본인 명의의 인증 수단 정보를 정확히 입력해 주세요.'
    },
    {
        id: 2,
        content: '법인명의 휴대전화(법인폰)는 통신사에서 본인인증 서비스 신청 후 휴대폰 인증을 하실 수 있습니다.'
    },
    {
        id: 3,
        content: '인증 오류 시 코리아크레딧뷰로 고객센터 02-708-1000에 문의해 주세요. '
    },
]

export const signupNotice: FindIdNotice[]= [
    {
        id: 1,
        content: '본인 명의의 인증 수단 정보를 정확히 입력해 주세요.'
    },
    {
        id: 2,
        content: '법인명의 휴대전화(법인폰)는 통신사에서 본인인증 서비스 신청 후 휴대폰 인증을 하실 수 있습니다.'
    },
    {
        id: 3,
        content: '개명하신 회원님의 경우 통신사 등에 등록된 본인인증 정보가 개명하신 이름으로 바뀐 이후부터 자동으로 변경됩니다. '
    },
    {
        id: 4,
        content: '인증 오류 시 코리아크레딧뷰로 고객센터 02-708-1000에 문의해 주세요.'
    },
]

export const agreeNotice: FindIdNotice[]= [
    {
        id: 1,
        content: '선택항목 수집 및 이용동의를 거부하시더라도 기본 서비스는 이용하실 수 있습니다.'
    },
    {
        id: 2,
        content: '이미 신세계포인트 회원이신 경우 신세계포인트 온라인 통합ID 가입 시 입력한 정보로 회원정보가 변경됩니다.'
    },
]

export const findPwNotice: FindIdNotice[]= [
    {
        id: 1,
        content: '영문 대/소문자, 숫자, 특수문자 중 3가지 이상을 조합하여 8-20자리로 입력해 주세요.'
    },
    {
        id: 2,
        content: '직전에 사용한 비밀번호는 사용하실 수 없습니다.'
    },
    {
        id: 3,
        content: '아이디와 동일한 비밀번호는 사용하실 수 없습니다.'
    },
    {
        id: 4,
        content: '생년월일, 전화번호와 동일하거나 일부를 포함한 비밀번호는 사용하실 수 없습니다.'
    },
    {
        id: 5,
        content: '3글자 이상의 동일한 숫자/문자 또는 연속된 숫자/문자, 키보드 상 연속된 배열의 문자는 입력하실 수 없습니다.'
    },
    {
        id: 6,
        content: '비밀번호 변경 시 신세계포인트 통합ID로 로그인하는 모든 신세계 그룹사 사이트의 비밀번호가 동일하게 변경됩니다. (최대 10분 소요)'
    },
]

export const giftpntNotice: FindIdNotice[]= [
    {
        id: 1,
        content: '신세계포인트 본인인증을 완료한 회원에게만 선물하기가 가능합니다. (본인 인증을 하지 않은 회원, 휴면회원, 법인회원은 불가합니다.)'
    },
    {
        id: 2,
        content: '주소록 서비스는 모바일앱에서만 사용하실 수 있어요.'
    },
    {
        id: 3,
        content: '포인트를 선물하시면 즉시 포인트가 차감되며 받으시는 분이 거절하거나 15일 이내에 수락하지 않을 경우 차감된 포인트는 자동으로 반환됩니다.'
    },
    {
        id: 4,
        content: '포인트 선물하기 시 포인트 비밀번호(숫자4자리) 입력이 필요합니다.'
    },
    {
        id: 5,
        content: '포인트 선물하기 완료 후 선물을 취소할 수 없어요.'
    },
    
]

export const regAffiliatePntCardNotice: FindIdNotice[]= [
    {
        id: 1,
        content: '제휴 멤버십 동시 적립 서비스는 이마트에서만 제공되는 서비스입니다..)'
    },
    {
        id: 2,
        content: '해당 제휴사에서 승인된 멤버십 카드 번호만 등록하실 수 있습니다'
    },
    {
        id: 3,
        content: '제휴사당 최대 1개의 카드만 등록하실 수 있습니다.'
    },
    {
        id: 4,
        content: '잘못된 제휴 멤버십 카드번호 등록 시 제휴 포인트는 적립되지 않으며 잘못된 정보 등록에 대한 책임은 등록한 회원에게 있습니다'
    },
    {
        id: 5,
        content: '제휴 멤버십의 상태가 정상일 경우에만 포인트가 적립됩니다. (휴면/탈퇴 시 적립불가)'
    },
    {
        id: 6,
        content: '이미 등록된 제휴 멤버십 카드는 다른 ID로 중복 등록할 수 없습니다.'
    },
    {
        id: 7,
        content: '동시 적립 서비스만 제공되며, 제휴 포인트 사용을 원할 경우에는 해당 제휴사 카드를 제시해야 합니다.'
    },
    {
        id: 8,
        content: '제휴 종료 시 사전 공지드리며, 기존에 등록된 제휴 멤버십 카드번호는 종료일 기준으로 일괄 삭제됩니다.'
    },
    {
        id: 9,
        content: '자세한 제휴 포인트의 적립/사용 정책은 해당 제휴사에 문의해 주세요.'
    },
    
    
]
export const luckServiceNotice: FindIdNotice[]= [
    {
        id: 1,
        content: '운세의 모든 서비스는 신세계포인트와 제휴를 맺은 ㈜고든에서 제공 및 관리합니다.'
    },
    {
        id: 2,
        content: "서비스 이용 관련 자세한 내용은 ㈜고든으로 문의해주시기 바랍니다. ㈜고든 고객센터 : 070-7600-9624"
    }
]

export const rcvAgreeNotice: FindIdNotice[]= [
    {
        id: 1,
        content: '광고정보 수신거부와 관계없이 회원 및 서비스 정책 변경, 주문/배송 안내, 법적 의무사항 등 안내성 고지 사항은 정상 발송됩니다.'
    },
    {
        id: 2,
        content: "광고정보 수신거부 전 예약 발송된 광고 메시지가 있는 경우 약 1-2일 동안 발송될 수 있습니다."
    }
]

export const withdrawalNotice: FindIdNotice[]= [
    {
        id: 1,
        content: '통합 멤버십을 가입하신 경우, 가입처에서 해당 멤버십을 먼저 탈퇴해 주셔야 신세계포인트 탈퇴가 가능합니다. 탈퇴는 가입처에 문의해주세요.'
    },
    {
        id: 2,
        content: "멤버십 가입일자와 혜택이 적용되는 시작일자는 상이할 수 있습니다."
    },
    {
        id: 3,
        content: '신세계 유니버스 클럽을 탈회 하셔도, 해당 포인트 카드로 신세계포인트 서비스는 계속 이용하실 수 있습니다.'
    },
    {
        id: 4,
        content: "G마켓/옥션의 스마일 클럽에서 신세계 유니버스 클럽으로 전환한 회원의 경우, 스마일 클럽의 첫 가입일자가 표기됩니다."
    }
]

export const leaveOnlineNotice: FindIdNotice[]= [
    {
        id: 1,
        content: '회원 탈퇴 시 현재 이용 중인 모든 신세계포인트 통합ID 서비스 및 사이트를 더 이상 이용하실 수 없어요!'
    },
    {
        id: 2,
        content: '신세계포인트 정책에 따라 회원탈퇴 후 5일 동안 다시 가입할 수 없습니다.'
    },
    {
        id: 3,
        content: "회원 탈퇴 시 보유하고 계신 포인트, 쿠폰, 각종 적립금 등 모든 혜택은 자동 소멸되며 복구되지 않습니다."
    },
    {
        id: 4,
        content: '트레이더스 유료 멤버십(TRADERS CLUB) 회원인 경우, 클럽(멤버십)을 먼저 탈회하신 뒤에 회원탈퇴가 가능합니다.'
    },
    {
        id: 5,
        content: "회원 탈퇴 후 다시 가입하시는 경우 신규 회원으로 가입되며, 이전의 회원정보 및 혜택은 복원되지 않습니다."
    },
    {
        id: 6,
        content: "회원 탈퇴 전 예약 발송된 광고 메시지가 있는 경우 약 1-2일 동안 발송될 수 있습니다."
    },
    {
        id: 7,
        content: "회원 탈퇴 시 신세계포인트 온라인 통합ID 회원만 탈퇴되며, 오프라인 서비스는 계속 이용하실 수 있습니다. (단, 오프라인 카드 미보유 회원은 완전히 탈퇴되며, 신세계포인트의 모든 서비스를 더 이상 이용하실 수 없습니다.)"
    }
]

export const deleteNotice: FindIdNotice[]= [
    {
        id: 1,
        content: '회원 탈퇴 시 현재 이용 중인 모든 신세계포인트 통합ID 서비스 및 사이트를 더 이상 이용하실 수 없습니다.'
    },
    {
        id: 2,
        content: '신세계포인트 정책에 따라 회원탈퇴 후 5일 동안 재가입이 불가합니다.'
    },
    {
        id: 3,
        content: "회원 탈퇴 시 보유하고 계신 포인트, 쿠폰, 각종 적립금 등 모든 혜택은 자동 소멸되며 복구 불가합니다."
    },
    {
        id: 4,
        content: '트레이더스 유료 멤버십(TRADERS CLUB) 회원인 경우, 클럽(멤버십)을 먼저 탈회하신 뒤에 회원탈퇴가 가능합니다.'
    },
    {
        id: 5,
        content: "회원 탈퇴 후 재가입 시 신규 회원으로 가입되며, 탈퇴 전의 회원정보 및 혜택은 복원되지 않습니다."
    },
    {
        id: 6,
        content: "회원 탈퇴 전 예약 발송된 광고 메시지가 있는 경우 약 1-2일 동안 발송될 수 있습니다."
    },
    {
        id: 7,
        content: "회원 탈퇴 시 신세계포인트 온라인 통합ID 회원 탈퇴가 되며, 신세계포인트 오프라인 서비스는 계속 이용 가능합니다. (단, 오프라인 카드 미보유 회원은 신세계포인트 회원 탈퇴되며, 신세계포인트의 모든 서비스를 더 이상 이용하실 수 없습니다.)"
    }
]
